DROP TABLE if EXISTS tasks;
CREATE TABLE tasks(
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
`name` VARCHAR(50) NOT NULL,
planned_date DATE NOT NULL
);

INSERT INTO tasks(`name`,planned_date)
VALUES
('Прибраться','2017-12-31'),
('Построить дом','2028-01-01'),
('Помыть посуду','2018-01-03'),
('Вырастить сына','2029-09-01'),
('Купить продукты','2017-12-30'),
('Починить кран','2018-01-05'),
('Помыть машину','2018-03-03'),
('Посадить дерево','2024-05-14'),
('Помыть окна','2018-01-07'),
('Покорить Эверест','2027-04-04');

DROP TABLE if EXISTS users11;
CREATE TABLE users11(
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
first_name VARCHAR(50) NOT NULL,
last_name VARCHAR(50) NOT NULL,
birthday DATE NOT NULL
);

INSERT INTO users11(first_name,last_name,birthday)
VALUES
('Вероника','Петрова','1986-04-30'),
('Светлана','Иванова','1990-01-22'),
('Елена','Абрамова','1994-05-01'),
('Василиса','Кац','1991-12-12'),
('Алёна','Сорокина','1994-01-07'),
('Алёна','Федькова','1989-02-17'),
('Лиана','Сорокин','1997-04-29'),
('Карина','Белая','1994-06-12'),
('Анастасия','Дейчман','1994-06-11'),
('Юлия','Фёдорова','1992-02-18');

DROP TABLE if EXISTS visits;
CREATE TABLE visits(
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
user_id INT UNSIGNED,
`date` DATEtime NOT NULL
);
INSERT INTO visits(user_id,`date`)
VALUES
(1,'2017-06-21 11:35:17'),
(5	,'2017-06-21 12:12:02'),
(145,'2017-06-21 15:43:18'),
(147,'2017-06-22 10:01:00'),
(276,'2017-06-22 12:00:00'),
(18,'2017-06-22 12:04:17'),
(7,'2017-06-22 12:59:59'),
(1873,'2017-06-22 13:00:00'),
(18,'2017-06-22 13:00:01'),
(187,'2017-06-22 14:45:54'),
(147,'2017-06-24 11:35:01'),
(971,'2017-06-24 12:50:44'),
(91,'2017-06-24 11:35:17'),
(1355,'2017-07-22 11:44:41'),
(987,'2017-07-22 12:15:07'),
(34,'2017-07-22 14:00:29');

DROP TABLE if EXISTS calendar2;
CREATE TABLE calendar2(
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
user_id INT UNSIGNED,
visit_date DATEtime NOT NULL
);

INSERT INTO calendar2(user_id,visit_date)
VALUES
(1,'2017-05-13 11:00:00'),
(5,'2017-05-13 12:00:00'),
(145,'2017-05-13 15:30:00'),
(147,'2017-05-14 10:00:00'),
(276,'2017-05-14 12:00:00'),
(18,'2017-05-14 13:00:00'),
(7,'2017-05-14 14:00:00'),
(1873,'2017-05-14 15:30:00'),
(18,'2017-05-14 16:30:00'),
(147,'2017-05-16 11:00:00'),
(971,'2017-05-16 12:30:00'),
(91,'2017-05-16 15:30:00'),
(1355,'2017-06-14 11:00:00'),
(987,'2017-06-14 12:30:00'),
(34,'2017-06-14 14:00:00');

DROP TABLE if EXISTS drivers;
CREATE TABLE drivers(
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
first_name VARCHAR(50) NOT NULL,
last_name VARCHAR(50) NOT NULL,
birthday DATE NOT NULL,
sex VARCHAR(50) NOT NULL
);

INSERT INTO drivers(first_name,last_name,birthday,sex)
VALUES
('Дмитрий','Федьков','2010-01-02','m'),
('Светлана','Иванова','1999-03-02','w'),	
('Никита','Трутнев','2008-08-08','m'),
('Денис','Кац','2000-08-09','m'),
('Алена','Сорокина','2001-01-02','w'),
('Василий','Федьков','2001-01-01','m'),
('Ярослав','Сорокин','2003-08-01','m'),
('Денис','Белый','2000-12-09','m'),
('Анатолий','Дейчман','1998-08-09','m'),
('Юлия','Фёдорова','2002-08-08','w'),
('Вячеслав','Кирин','2007-08-07','m'),
('Мавлетов','Марат','2005-05-06','m'),
('Елизавета','Романова','2000-08-08','w');

DROP TABLE if EXISTS payments;
CREATE TABLE payments(
id INT UNSIGNED AUTO_INCREMENT PRIMARY KEY,
user_id INT UNSIGNED,
`date` DATEtime NOT NULL,
amount INT UNSIGNED NOT null
);

INSERT INTO payments(user_id,`date`,amount)
VALUES
(1,'2017-02-01 11:35:17',1100),
(145,'2017-02-03 15:43:18',1200),
(5,'2017-02-14 12:12:02',1200),
(34,'	2017-02-27 14:00:29',1300),
(147,'2017-03-01 10:01:00',700),
(276,'2017-03-04 12:00:00',850),
(87,'	2017-03-06 23:12:04',400),
(18,'	2017-03-06 12:04:17',1400),
(1873,'2017-03-07 13:00:00',4400),
(7	,'2017-03-14 12:59:59',	3000),
(987,'2017-03-25 12:15:07',780),
(18,'2017-03-26 13:00:01',1900),
(91,'2017-04-24 11:35:17',250),
(147,'2017-04-24 11:35:01',1100),
(971,'2017-04-27 12:50:44',5000),
(1355,'2017-04-28 11:44:41',790);



